ClimbSnail/HoloCubic_AIO/HoloCubic_Firmware/lib/ESP32_FTPServer_SD/ESP32FtpServer.cpp
/*
 * FTP Serveur for ESP8266
 * based on FTP Serveur for Arduino Due and Ethernet shield (W5100) or WIZ820io (W5200)
 * based on Jean-Michel Gallego's work
 * modified to work with esp8266 SPIFFS by David Paiva david@nailbuster.com
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */
//  2017: modified by @robo8080

#include "ESP32FtpServer.h"

#include <WiFi.h>
#include <WiFiClient.h>
//#include <ESP32WebServer.h>
#include <FS.h>
#include "SD.h"
#include "SPI.h"

#define FTP_DEBUG

WiFiServer ftpServer(FTP_CTRL_PORT);
WiFiServer dataServer(FTP_DATA_PORT_PASV);

void FtpServer::begin(String uname, String pword)
{
    // Tells the ftp server to begin listening for incoming connection
    _FTP_USER = uname;
    _FTP_PASS = pword;

    ftpServer.begin();
    delay(10);
    dataServer.begin();
    delay(10);
    millisTimeOut = (uint32_t)FTP_TIME_OUT * 60 * 1000;
    millisDelay = 0;
    cmdStatus = 0;
    iniVariables();
}

void FtpServer::iniVariables()
{
    // Default for data port
    dataPort = FTP_DATA_PORT_PASV;

    // Default Data connection is Active
    dataPassiveConn = true;

    // Set the root directory
    strcpy(cwdName, "/");

    rnfrCmd = false;
    transferStatus = 0;
}

void FtpServer::handleFTP()
{
    if ((int32_t)(millisDelay - millis()) > 0)
        return;

    if (ftpServer.hasClient())
    {
        //  if (ftpServer.available()) {
        client.stop();
        client = ftpServer.available();
    }

    if (cmdStatus == 0)
    {
        if (client.connected())
            disconnectClient();
        cmdStatus = 1;
    }
    else if (cmdStatus == 1) // Ftp server waiting for connection
    {
        abortTransfer();
        iniVariables();
#ifdef FTP_DEBUG
        Serial.println("Ftp server waiting for connection on port " + String(FTP_CTRL_PORT));
#endif
        cmdStatus = 2;
    }
    else if (cmdStatus == 2) // Ftp server idle
    {

        if (client.connected()) // A client connected
        {
            clientConnected();
            millisEndConnection = millis() + 10 * 1000; // wait client id during 10 s.
            cmdStatus = 3;
        }
    }
    else if (readChar() > 0) // got response
    {
        if (cmdStatus == 3) // Ftp server waiting for user identity
            if (userIdentity())
                cmdStatus = 4;
            else
                cmdStatus = 0;
        else if (cmdStatus == 4) // Ftp server waiting for user registration
            if (userPassword())
            {
                cmdStatus = 5;
                millisEndConnection = millis() + millisTimeOut;
            }
            else
                cmdStatus = 0;
        else if (cmdStatus == 5) // Ftp server waiting for user command
            if (!processCommand())
                cmdStatus = 0;
            else
                millisEndConnection = millis() + millisTimeOut;
    }
    else if (!client.connected() || !client)
    {
        cmdStatus = 1;
#ifdef FTP_DEBUG
        Serial.println("client disconnected");
#endif
    }

    if (transferStatus == 1) // Retrieve data
    {
        if (!doRetrieve())
            transferStatus = 0;
    }
    else if (transferStatus == 2) // Store data
    {
        if (!doStore())
            transferStatus = 0;
    }
    else if (cmdStatus > 2 && !((int32_t)(millisEndConnection - millis()) > 0))
    {
        client.println("530 Timeout");
        millisDelay = millis() + 200; // delay of 200 ms
        cmdStatus = 0;
    }
}

void FtpServer::clientConnected()
{
#ifdef FTP_DEBUG
    Serial.println("Client connected!");
#endif
    client.println("220--- Welcome to FTP for ESP8266 ---");
    client.println("220---   By David Paiva   ---");
    client.println("220 --   Version " + String(FTP_SERVER_VERSION) + "   --");
    iCL = 0;
}

void FtpServer::disconnectClient()
{
#ifdef FTP_DEBUG
    Serial.println(" Disconnecting client");
#endif
    abortTransfer();
    client.println("221 Goodbye");
    client.stop();
}

boolean FtpServer::userIdentity()
{
    if (strcmp(command, "USER"))
        client.println("500 Syntax error");
    if (strcmp(parameters, _FTP_USER.c_str()))
        client.println("530 user not found");
    else
    {
        client.println("331 OK. Password required");
        strcpy(cwdName, "/");
        return true;
    }
    millisDelay = millis() + 100; // delay of 100 ms
    return false;
}

boolean FtpServer::userPassword()
{
    if (strcmp(command, "PASS"))
        client.println("500 Syntax error");
    else if (strcmp(parameters, _FTP_PASS.c_str()))
        client.println("530 ");
    else
    {
#ifdef FTP_DEBUG
        Serial.println("OK. Waiting for commands.");
#endif
        client.println("230 OK.");
        return true;
    }
    millisDelay = millis() + 100; // delay of 100 ms
    return false;
}

boolean FtpServer::processCommand()
{
    ///////////////////////////////////////
    //                                   //
    //      ACCESS CONTROL COMMANDS      //
    //                                   //
    ///////////////////////////////////////
    Serial.print("processCommand: ");
    Serial.println(command);
    //
    //  CDUP - Change to Parent Directory
    //
    if (!strcmp(command, "CDUP"))
    {
        client.println("250 Ok. Current directory is " + String(cwdName));
    }
    //
    //  CWD - Change Working Directory
    //
    else if (!strcmp(command, "CWD"))
    {
        Serial.println(cwdName);
        char path[FTP_CWD_SIZE];
        if (strcmp(parameters, ".") == 0) // 'CWD .' is the same as PWD command
            client.println("257 \"" + String(cwdName) + "\" is your current directory");
        else
        {
            client.println("250 Ok. Current directory is " + String(cwdName));
        }
    }
    //
    //  PWD - Print Directory
    //
    else if (!strcmp(command, "PWD"))
        client.println("257 \"" + String(cwdName) + "\" is your current directory");
    //
    //  QUIT
    //
    else if (!strcmp(command, "QUIT"))
    {
        disconnectClient();
        return false;
    }

