ClimbSnail/HoloCubic_AIO/HoloCubic_Firmware/lib/ESP32_FTPServer_SD/ESP32FtpServer.cpp
    ///////////////////////////////////////
    //                                   //
    //   EXTENSIONS COMMANDS (RFC 3659)  //
    //                                   //
    ///////////////////////////////////////

    //
    //  FEAT - New Features
    //
    else if (!strcmp(command, "FEAT"))
    {
        client.println("211-Extensions suported:");
        client.println(" MLSD");
        client.println("211 End.");
    }
    //
    //  MDTM - File Modification Time (see RFC 3659)
    //
    else if (!strcmp(command, "MDTM"))
    {
        client.println("550 Unable to retrieve time");
    }

    //
    //  SIZE - Size of the file
    //
    else if (!strcmp(command, "SIZE"))
    {
        char path[FTP_CWD_SIZE];
        if (strlen(parameters) == 0)
            client.println("501 No file name");
        else if (makePath(path))
        {
            file = SD.open(path, "r");
            if (!file)
                client.println("450 Can't open " + String(parameters));
            else
            {
                client.println("213 " + String(file.size()));
                file.close();
            }
        }
    }
    //
    //  SITE - System command
    //
    else if (!strcmp(command, "SITE"))
    {
        client.println("500 Unknow SITE command " + String(parameters));
    }
    //
    //  Unrecognized commands ...
    //
    else
        client.println("500 Unknow command");

    return true;
}

boolean FtpServer::dataConnect()
{
    unsigned long startTime = millis();
    // wait 5 seconds for a data connection
    if (!data.connected())
    {
        while (!dataServer.hasClient() && millis() - startTime < 10000)
        //    while (!dataServer.available() && millis() - startTime < 10000)
        {
            // delay(100);
            yield();
        }
        if (dataServer.hasClient())
        {
            //    if (dataServer.available()) {
            data.stop();
            data = dataServer.available();
#ifdef FTP_DEBUG
            Serial.println("ftpdataserver client....");
#endif
        }
    }

    return data.connected();
}

boolean FtpServer::doRetrieve()
{
    // int16_t nb = file.readBytes((uint8_t*) buf, FTP_BUF_SIZE );
    int16_t nb = file.readBytes(buf, FTP_BUF_SIZE);
    if (nb > 0)
    {
        data.write((uint8_t *)buf, nb);
        bytesTransfered += nb;
        return true;
    }
    closeTransfer();
    return false;
}

boolean FtpServer::doStore()
{
    if (data.connected())
    {
        int16_t nb = data.readBytes((uint8_t *)buf, FTP_BUF_SIZE);
        if (nb > 0)
        {
            // Serial.println( millis() << " " << nb << endl;
            file.write((uint8_t *)buf, nb);
            bytesTransfered += nb;
        }
        return true;
    }
    closeTransfer();
    return false;
}

void FtpServer::closeTransfer()
{
    uint32_t deltaT = (int32_t)(millis() - millisBeginTrans);
    if (deltaT > 0 && bytesTransfered > 0)
    {
        client.println("226-File successfully transferred");
        client.println("226 " + String(deltaT) + " ms, " + String(bytesTransfered / deltaT) + " kbytes/s");
    }
    else
        client.println("226 File successfully transferred");

    file.close();
    data.stop();
}

void FtpServer::abortTransfer()
{
    if (transferStatus > 0)
    {
        file.close();
        data.stop();
        client.println("426 Transfer aborted");
#ifdef FTP_DEBUG
        Serial.println("Transfer aborted!");
#endif
    }
    transferStatus = 0;
}

// Read a char from client connected to ftp server
//
//  update cmdLine and command buffers, iCL and parameters pointers
//
//  return:
//    -2 if buffer cmdLine is full
//    -1 if line not completed
//     0 if empty line received
//    length of cmdLine (positive) if no empty line received

int8_t FtpServer::readChar()
{
    int8_t rc = -1;

    if (client.available())
    {
        char c = client.read();
        // char c;
        // client.readBytes((uint8_t*) c, 1);
#ifdef FTP_DEBUG
        Serial.print("c ----> ");
        Serial.println(c);
#endif
        if (c == '\\')
            c = '/';
        if (c != '\r')
            if (c != '\n')
            {
                if (iCL < FTP_CMD_SIZE)
                    cmdLine[iCL++] = c;
                else
                    rc = -2; //  Line too long
            }
            else
            {
                cmdLine[iCL] = 0;
                command[0] = 0;
                parameters = NULL;
                // empty line?
                if (iCL == 0)
                    rc = 0;
                else
                {
                    rc = iCL;
                    // search for space between command and parameters
                    parameters = strchr(cmdLine, ' ');
                    if (parameters != NULL)
                    {
                        if (parameters - cmdLine > 4)
                            rc = -2; // Syntax error
                        else
                        {
                            strncpy(command, cmdLine, parameters - cmdLine);
                            command[parameters - cmdLine] = 0;

                            while (*(++parameters) == ' ')
                                ;
                            strncpy(cwdName, parameters, iCL-(parameters - cmdLine));
                            Serial.print("cwdName ----> ");
                            Serial.println(cwdName);
                        }
                    }
                    else if (strlen(cmdLine) > 4)
                        rc = -2; // Syntax error.
                    else
                        strcpy(command, cmdLine);
                    iCL = 0;
                }
            }
        if (rc > 0)
            for (uint8_t i = 0; i < strlen(command); i++)
                command[i] = toupper(command[i]);
        if (rc == -2)
        {
            iCL = 0;
            client.println("500 Syntax error");
        }
    }
    return rc;
}

// Make complete path/name from cwdName and parameters
//
// 3 possible cases: parameters can be absolute path, relative path or only the name
//
// parameters:
//   fullName : where to store the path/name
//
// return:
//    true, if done

