ClimbSnail/HoloCubic_AIO/HoloCubic_Firmware/lib/ESP32_FTPServer_SD/ESP32FtpServer.cpp
boolean FtpServer::makePath(char *fullName)
{
    return makePath(fullName, parameters);
}

boolean FtpServer::makePath(char *fullName, char *param)
{
    if (param == NULL)
        param = parameters;

    // Root or empty?
    if (strcmp(param, "/") == 0 || strlen(param) == 0)
    {
        strcpy(fullName, "/");
        return true;
    }
    // If relative path, concatenate with current dir
    if (param[0] != '/')
    {
        strcpy(fullName, cwdName);
        if (fullName[strlen(fullName) - 1] != '/')
            strncat(fullName, "/", FTP_CWD_SIZE);
        strncat(fullName, param, FTP_CWD_SIZE);
    }
    else
        strcpy(fullName, param);
    // If ends with '/', remove it
    uint16_t strl = strlen(fullName) - 1;
    if (fullName[strl] == '/' && strl > 1)
        fullName[strl] = 0;
    if (strlen(fullName) < FTP_CWD_SIZE)
        return true;

    client.println("500 Command line too long");
    return false;
}

// Calculate year, month, day, hour, minute and second
//   from first parameter sent by MDTM command (YYYYMMDDHHMMSS)
//
// parameters:
//   pyear, pmonth, pday, phour, pminute and psecond: pointer of
//     variables where to store data
//
// return:
//    0 if parameter is not YYYYMMDDHHMMSS
//    length of parameter + space

uint8_t FtpServer::getDateTime(uint16_t *pyear, uint8_t *pmonth, uint8_t *pday,
                               uint8_t *phour, uint8_t *pminute, uint8_t *psecond)
{
    char dt[15];

    // Date/time are expressed as a 14 digits long string
    //   terminated by a space and followed by name of file
    if (strlen(parameters) < 15 || parameters[14] != ' ')
        return 0;
    for (uint8_t i = 0; i < 14; i++)
        if (!isdigit(parameters[i]))
            return 0;

    strncpy(dt, parameters, 14);
    dt[14] = 0;
    *psecond = atoi(dt + 12);
    dt[12] = 0;
    *pminute = atoi(dt + 10);
    dt[10] = 0;
    *phour = atoi(dt + 8);
    dt[8] = 0;
    *pday = atoi(dt + 6);
    dt[6] = 0;
    *pmonth = atoi(dt + 4);
    dt[4] = 0;
    *pyear = atoi(dt);
    return 15;
}

// Create string YYYYMMDDHHMMSS from date and time
//
// parameters:
//    date, time
//    tstr: where to store the string. Must be at least 15 characters long
//
// return:
//    pointer to tstr

char *FtpServer::makeDateTimeStr(char *tstr, uint16_t date, uint16_t time)
{
    sprintf(tstr, "%04u%02u%02u%02u%02u%02u",
            ((date & 0xFE00) >> 9) + 1980, (date & 0x01E0) >> 5, date & 0x001F,
            (time & 0xF800) >> 11, (time & 0x07E0) >> 5, (time & 0x001F) << 1);
    return tstr;
}
